## Project Name: Olympics Analysis

- Sports goes into entertainment category as far as viewers are concerned.
- Olympic athletes are considered as benchmarks in regards with their Strength, Agility and Intelligence.

### Project goal:
- To explore a dataset on the modern Summer Olympic Games - Athens data from 1896 to Rio 2016.
- In this project, I investigate on the results and understand trends of Olympics results. 
- Answer some common questions about the Summer Olympics.

### Dataset:
- Dataset have records at an individual Athlete competing in an individual Olympic events. 
- Columns as Name, Age, Medal_Won, Game, Year, and so on.

### Using summer olympics dataset we try to find out following questions answer:

### Phase 1: Data Collection

 ##### We are using two tables which are available at MySQL database:
 - olympics_history table where each row corresponds to an individual athlete competing in an individual Olympic event.
 - olympics_history_noc_regions contains NOC(National Olympic Committee  a 3-letter code) which helps us to add country information and its correspondion region from its NOC code.

In [108]:
# importing Basic libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

### Phase 2: Data Understanding

In [109]:
# Connecting to MySql Database
import mysql.connector
mydb=mysql.connector.connect(
host="localhost",
user="root",
password="Sangeeta@4820",
use_pure=True)

In [118]:
query1 = '''SELECT * FROM Olympics.olympics_history'''

In [119]:
olympics_history_df = pd.read_sql_query(query, mydb)

In [120]:
olympics_history_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24,180,80,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NA
1,2,A Lamusi,M,23,170,60,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NA
2,3,Gunnar Nielsen Aaby,M,24,NA,NA,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NA
3,4,Edgar Lindenau Aabye,M,34,NA,NA,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21,185,82,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NA

In [121]:
query2 ='''SELECT * FROM Olympics.olympics_history_noc_regions'''

In [122]:
olympics_history_noc_regions_df = pd.read_sql_query(query2, mydb)

In [124]:
olympics_history_noc_regions_df.head()

   NOC       region                 notes
0  AFG  Afghanistan
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

#### Column names:

In [184]:
query='''
SELECT COLUMN_NAME 
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE TABLE_SCHEMA='Olympics' 
AND TABLE_NAME='olympics_history';
'''

In [185]:
olympics_histoty_data = pd.read_sql_query(query, mydb)

In [186]:
olympics_histoty_data

   COLUMN_NAME
0          Age
1         City
2        Event
3        Games
4       Height
5           ID
6        Medal
7         Name
8          NOC
9       Season
10         Sex
11       Sport
12        Team
13      Weight
14        Year

### Observation:

#### olympics_history table

1. Id:
    - Represents unique number for each athlete.
2. Name:
    - Represents name of the athlete.
3. Sex:
    - Represents sex of athlete.
    - M for Male ,F for female
4. Age:
    - Represents age of an athlete 
5. Height:
    - Represents height of an athlete in cm.
    - It has 51402 null values.
6. Weight:
    - Represents Weight of an athlete in kg.
    - It has 54074 null values.
7. Team:
    - Represents for which team an athelete was playing.
8. NOC:
    - Represents National Olympic Committee which is 3-letter code.
9. Games:
    - Represents year and season olympic games was hosted.
10. Year:
    - Represnts for which year olympic games was hosted.
11. Season:
    - reprsents for which season olympic games was hosted.
12. City:
    - Represents host city for respective olympic games.
13. Sport:
    - Represents Sport played by each athlete in olympic games.
14. Event:
    - Represents event name with respect to each game.
15. Medal:
    - Represents  type of medal won by each athlete.
    - It contains gold,silver,bronze medals.
    - NA represnts no medal won by the athlete.
    - There are 222153 null values.

#### olympics_history_noc_regions table
1. NOC:
 - Represents National Olympic Committee which is 3-letter code.
2. region:
  - Represents in which region olympic games was hosted.
3. notes:
 - Represents some additional notes with respect to every region.

#### Null values in each columns:

In [194]:
query='''

WITH column_name_cte AS(
SELECT COLUMN_NAME
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME = 'olympics_history'
),
count_null_values AS(
SELECT 'id' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE ID ='NA'
UNION 
SELECT 'name' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Name ='NA'
UNION 
SELECT 'sed' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Sex ='Na'
UNION 
SELECT 'age' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Age ='Na'
UNION 
SELECT 'height' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Height ='Na'
UNION 
SELECT 'weight' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Weight ='Na'
UNION 
SELECT 'team' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Team ='Na'
UNION 
SELECT 'noc' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE NOC ='Na'
UNION 
SELECT 'games' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Games ='Na'
UNION 
SELECT 'year' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Year ='Na'
UNION 
SELECT 'season' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Season ='Na'
UNION 
SELECT 'city' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE City ='Na'
UNION 
SELECT 'sport' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Sport ='Na'
UNION 
SELECT 'event' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Event ='Na'
UNION 
SELECT 'medal' AS col_name, COUNT(*) AS null_values FROM Olympics.olympics_history WHERE Medal ='Na'

)
SELECT * FROM count_null_values
'''

In [179]:
olympics_histoty_data = pd.read_sql_query(query, mydb)

In [180]:
olympics_histoty_data

   col_name  null_values
0        id            0
1      name            0
2       sed            0
3       age            0
4    height        51402
5    weight        54074
6      team            0
7       noc            0
8     games            0
9      year            0
10   season            0
11     city            0
12    sport            0
13    event            0
14    medal       222153

### Phase 3: Data Querying using SQL:

In [115]:
query = '''
            SELECT 
                Name AS name,
                Sex AS sex,
                Height AS height
            FROM 
                Olympics.olympics_history 
            WHERE 
                Year = (SELECT 
                            min(Year)
                        FROM Olympics.olympics_history
                        )
        '''

In [116]:
data = pd.read_sql_query(query, mydb)

In [117]:
data

              nameakdjfkajdfakjdfa sex height
0             Arthur Charles Blake   M     NA
1             Arthur Charles Blake   M     NA
2        Conrad Helmut Fritz Bcker   M     NA
3        Conrad Helmut Fritz Bcker   M     NA
4        Conrad Helmut Fritz Bcker   M     NA
..                             ...  ..    ...
212                 Thomas Xenakis   M     NA
213  Jules Alexis "Louis"" Zutter"   M     NA
214  Jules Alexis "Louis"" Zutter"   M     NA
215  Jules Alexis "Louis"" Zutter"   M     NA
216  Jules Alexis "Louis"" Zutter"   M     NA

[217 rows x 3 columns]